-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- 호스트: localhost
-- 생성 시간: 26-08-26 15:46
-- 서버 버전: 12.3.2-MariaDB
-- PHP 버전: 8.5.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `market`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `chat`
--

CREATE TABLE `chat` (
  `chat_id` int(11) NOT NULL,
  `to_member_id` int(11) NOT NULL,
  `from_member_id` int(11) NOT NULL,
  `text` text NOT NULL,
  `reg_date` datetime DEFAULT NULL,
  `state` tinyint(4) DEFAULT NULL,
  `product_id` int(11) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `chat`
--

INSERT INTO `chat` (`chat_id`, `to_member_id`, `from_member_id`, `text`, `reg_date`, `state`, `product_id`, `image`) VALUES
(1, 9, 10, '안녕하세요. 아직 판매중인가요?', '2026-07-28 10:00:00', 1, 21, NULL),
(2, 10, 9, '네 판매중입니다.', '2026-07-28 10:01:20', 1, 21, NULL),
(3, 9, 10, '오늘 거래 가능할까요?', '2026-07-28 10:03:00', 1, 21, NULL),
(4, 10, 9, '오후 3시 가능합니다.', '2026-07-28 10:04:30', 1, 21, NULL),
(5, 6, 10, '게임팩 구성품 있나요?', '2026-07-28 09:00:00', 1, 18, NULL),
(6, 10, 6, '네 전부 있습니다.', '2026-07-28 09:05:00', 1, 18, NULL),
(7, 6, 10, '예약 가능할까요?', '2026-07-28 09:07:00', 0, 18, NULL),
(8, 10, 9, '스위치2 아직 있나요?', '2026-07-28 11:00:00', 1, 19, NULL),
(9, 9, 10, '네 있습니다.', '2026-07-28 11:02:00', 1, 19, NULL),
(10, 10, 9, '오늘 저녁 거래 가능해요.', '2026-07-28 11:05:00', 1, 19, NULL),
(11, 10, 6, '아이폰 아직 판매중인가요?', '2026-07-28 12:00:00', 1, 20, NULL),
(12, 6, 10, '네 판매중입니다.', '2026-07-28 12:01:00', 1, 20, NULL),
(13, 10, 6, '직거래 원합니다.', '2026-07-28 12:03:00', 1, 20, NULL),
(15, 6, 10, 'qweqrweqwrqw', '2026-07-29 21:36:02', 0, 20, 'chat14.png'),
(16, 6, 10, 'qweqweqw', '2026-07-29 21:36:10', 0, 20, ''),
(17, 6, 10, 'ewrrweqqwrwr', '2026-07-29 21:36:12', 0, 20, ''),
(18, 6, 10, 'ㅋㅋㅋㅋㅋㅋㅋㅋ', '2026-07-29 21:36:17', 0, 20, ''),
(19, 9, 10, 'asdasdas', '2026-07-29 21:37:55', 0, 19, ''),
(20, 9, 10, '', '2026-07-29 22:03:51', 0, 19, 'chat20.png'),
(21, 9, 10, '11111', '2026-07-29 22:03:55', 0, 19, ''),
(22, 9, 10, 'qweqwe', '2026-07-31 17:05:56', 0, 19, ''),
(23, 9, 10, '', '2026-07-31 17:06:02', 0, 19, 'chat23.png'),
(24, 9, 10, 'qweqwe', '2026-07-31 17:08:49', 0, 19, ''),
(25, 11, 10, '11', '2026-08-09 21:22:30', 0, 23, ''),
(26, 11, 10, '112', '2026-08-09 21:22:35', 0, 23, 'chat26.png'),
(27, 11, 10, 'qqq', '2026-08-11 15:34:48', 0, 23, 'chat27.png'),
(28, 11, 10, 'qewqeqw', '2026-08-11 15:37:54', 0, 23, ''),
(29, 11, 10, '', '2026-08-11 15:37:57', 0, 23, 'chat29.png'),
(30, 4, 10, '111', '2026-08-11 19:26:29', 0, 24, 'chat30.png'),
(31, 9, 10, '직거래 하시나요?', '2026-08-14 14:45:32', 0, 21, 'chat31.png'),
(32, 11, 10, 'asdsa', '2026-08-14 15:24:27', 0, 22, ''),
(33, 4, 13, '111', '2026-08-14 16:13:36', 0, 24, 'chat33.png'),
(34, 15, 19, '안녕하세요', '2026-08-19 15:55:44', 0, 26, ''),
(35, 15, 19, '거래 가능할까요?', '2026-08-19 15:55:54', 0, 26, ''),
(36, 11, 19, '지금 바로 거래 가능할까요', '2026-08-19 15:56:24', 0, 22, '');

-- --------------------------------------------------------

--
-- 테이블 구조 `good`
--

CREATE TABLE `good` (
  `good_id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `good`
--

INSERT INTO `good` (`good_id`, `member_id`, `product_id`) VALUES
(2, 10, 24),
(4, 10, 23),
(8, 10, 25),
(13, 19, 24),
(14, 19, 22),
(15, 19, 26),
(16, 19, 21);

-- --------------------------------------------------------

--
-- 테이블 구조 `juso`
--

CREATE TABLE `juso` (
  `id` int(11) NOT NULL,
  `juso1` varchar(20) NOT NULL,
  `juso2` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `juso`
--

INSERT INTO `juso` (`id`, `juso1`, `juso2`) VALUES
(1, '서울특별시', '중구'),
(2, '서울특별시', '종로구'),
(3, '서울특별시', '용산구'),
(4, '서울특별시', '성동구'),
(5, '서울특별시', '광진구'),
(6, '서울특별시', '동대문구'),
(7, '서울특별시', '중랑구'),
(8, '서울특별시', '성북구'),
(9, '서울특별시', '강북구'),
(10, '서울특별시', '도봉구'),
(11, '서울특별시', '노원구'),
(12, '서울특별시', '은평구'),
(13, '서울특별시', '서대문구'),
(14, '서울특별시', '마포구'),
(15, '서울특별시', '양천구'),
(16, '서울특별시', '강서구'),
(17, '서울특별시', '구로구'),
(18, '서울특별시', '금천구'),
(19, '서울특별시', '영등포구'),
(20, '서울특별시', '동작구'),
(21, '서울특별시', '관악구'),
(22, '서울특별시', '서초구'),
(23, '서울특별시', '강남구'),
(24, '서울특별시', '송파구'),
(25, '서울특별시', '강동구'),
(26, '전남광주통합특별시', '목포시'),
(27, '전남광주통합특별시', '여수시'),
(28, '전남광주통합특별시', '순천시'),
(29, '전남광주통합특별시', '나주시'),
(30, '전남광주통합특별시', '광양시'),
(31, '전남광주통합특별시', '동구'),
(32, '전남광주통합특별시', '서구'),
(33, '전남광주통합특별시', '남구'),
(34, '전남광주통합특별시', '북구'),
(35, '전남광주통합특별시', '광산구'),
(36, '전남광주통합특별시', '담양군'),
(37, '전남광주통합특별시', '곡성군'),
(38, '전남광주통합특별시', '구례군'),
(39, '전남광주통합특별시', '고흥군'),
(40, '전남광주통합특별시', '보성군'),
(41, '전남광주통합특별시', '화순군'),
(42, '전남광주통합특별시', '장흥군'),
(43, '전남광주통합특별시', '강진군'),
(44, '전남광주통합특별시', '해남군'),
(45, '전남광주통합특별시', '영암군'),
(46, '전남광주통합특별시', '무안군'),
(47, '전남광주통합특별시', '함평군'),
(48, '전남광주통합특별시', '영광군'),
(49, '전남광주통합특별시', '장성군'),
(50, '전남광주통합특별시', '완도군'),
(51, '전남광주통합특별시', '진도군'),
(52, '전남광주통합특별시', '신안군'),
(53, '부산광역시', '중구'),
(54, '부산광역시', '서구'),
(55, '부산광역시', '동구'),
(56, '부산광역시', '영도구'),
(57, '부산광역시', '부산진구'),
(58, '부산광역시', '동래구'),
(59, '부산광역시', '남구'),
(60, '부산광역시', '북구'),
(61, '부산광역시', '해운대구'),
(62, '부산광역시', '사하구'),
(63, '부산광역시', '금정구'),
(64, '부산광역시', '강서구'),
(65, '부산광역시', '연제구'),
(66, '부산광역시', '수영구'),
(67, '부산광역시', '사상구'),
(68, '부산광역시', '기장군'),
(69, '대구광역시', '중구'),
(70, '대구광역시', '동구'),
(71, '대구광역시', '서구'),
(72, '대구광역시', '남구'),
(73, '대구광역시', '북구'),
(74, '대구광역시', '수성구'),
(75, '대구광역시', '달서구'),
(76, '대구광역시', '달성군'),
(77, '대구광역시', '군위군'),
(78, '인천광역시', '제물포구'),
(79, '인천광역시', '영종구'),
(80, '인천광역시', '미추홀구'),
(81, '인천광역시', '연수구'),
(82, '인천광역시', '남동구'),
(83, '인천광역시', '부평구'),
(84, '인천광역시', '계양구'),
(85, '인천광역시', '서해구'),
(86, '인천광역시', '검단구'),
(87, '인천광역시', '강화군'),
(88, '인천광역시', '옹진군'),
(89, '대전광역시', '동구'),
(90, '대전광역시', '중구'),
(91, '대전광역시', '서구'),
(92, '대전광역시', '유성구'),
(93, '대전광역시', '대덕구'),
(94, '울산광역시', '중구'),
(95, '울산광역시', '남구'),
(96, '울산광역시', '동구'),
(97, '울산광역시', '북구'),
(98, '울산광역시', '울주군'),
(99, '세종특별자치시', '세종특별자치시'),
(100, '경기도', '수원시 장안구'),
(101, '경기도', '수원시 권선구'),
(102, '경기도', '수원시 팔달구'),
(103, '경기도', '수원시 영통구'),
(104, '경기도', '성남시 수정구'),
(105, '경기도', '성남시 중원구'),
(106, '경기도', '성남시 분당구'),
(107, '경기도', '의정부시'),
(108, '경기도', '안양시 만안구'),
(109, '경기도', '안양시 동안구'),
(110, '경기도', '부천시 원미구'),
(111, '경기도', '부천시 소사구'),
(112, '경기도', '부천시 오정구'),
(113, '경기도', '광명시'),
(114, '경기도', '평택시'),
(115, '경기도', '동두천시'),
(116, '경기도', '안산시 상록구'),
(117, '경기도', '안산시 단원구'),
(118, '경기도', '고양시 덕양구'),
(119, '경기도', '고양시 일산동구'),
(120, '경기도', '고양시 일산서구'),
(121, '경기도', '과천시'),
(122, '경기도', '구리시'),
(123, '경기도', '남양주시'),
(124, '경기도', '오산시'),
(125, '경기도', '시흥시'),
(126, '경기도', '군포시'),
(127, '경기도', '의왕시'),
(128, '경기도', '하남시'),
(129, '경기도', '용인시 처인구'),
(130, '경기도', '용인시 기흥구'),
(131, '경기도', '용인시 수지구'),
(132, '경기도', '파주시'),
(133, '경기도', '이천시'),
(134, '경기도', '안성시'),
(135, '경기도', '김포시'),
(136, '경기도', '화성시 만세구'),
(137, '경기도', '화성시 효행구'),
(138, '경기도', '화성시 병점구'),
(139, '경기도', '화성시 동탄구'),
(140, '경기도', '광주시'),
(141, '경기도', '양주시'),
(142, '경기도', '포천시'),
(143, '경기도', '여주시'),
(144, '경기도', '연천군'),
(145, '경기도', '가평군'),
(146, '경기도', '양평군'),
(147, '충청북도', '청주시 상당구'),
(148, '충청북도', '청주시 서원구'),
(149, '충청북도', '청주시 흥덕구'),
(150, '충청북도', '청주시 청원구'),
(151, '충청북도', '충주시'),
(152, '충청북도', '제천시'),
(153, '충청북도', '보은군'),
(154, '충청북도', '옥천군'),
(155, '충청북도', '영동군'),
(156, '충청북도', '증평군'),
(157, '충청북도', '진천군'),
(158, '충청북도', '괴산군'),
(159, '충청북도', '음성군'),
(160, '충청북도', '단양군'),
(161, '충청남도', '천안시 동남구'),
(162, '충청남도', '천안시 서북구'),
(163, '충청남도', '공주시'),
(164, '충청남도', '보령시'),
(165, '충청남도', '아산시'),
(166, '충청남도', '서산시'),
(167, '충청남도', '논산시'),
(168, '충청남도', '계룡시'),
(169, '충청남도', '당진시'),
(170, '충청남도', '금산군'),
(171, '충청남도', '부여군'),
(172, '충청남도', '서천군'),
(173, '충청남도', '청양군'),
(174, '충청남도', '홍성군'),
(175, '충청남도', '예산군'),
(176, '충청남도', '태안군'),
(177, '경상북도', '포항시 남구'),
(178, '경상북도', '포항시 북구'),
(179, '경상북도', '경주시'),
(180, '경상북도', '김천시'),
(181, '경상북도', '안동시'),
(182, '경상북도', '구미시'),
(183, '경상북도', '영주시'),
(184, '경상북도', '영천시'),
(185, '경상북도', '상주시'),
(186, '경상북도', '문경시'),
(187, '경상북도', '경산시'),
(188, '경상북도', '의성군'),
(189, '경상북도', '청송군'),
(190, '경상북도', '영양군'),
(191, '경상북도', '영덕군'),
(192, '경상북도', '청도군'),
(193, '경상북도', '고령군'),
(194, '경상북도', '성주군'),
(195, '경상북도', '칠곡군'),
(196, '경상북도', '예천군'),
(197, '경상북도', '봉화군'),
(198, '경상북도', '울진군'),
(199, '경상북도', '울릉군'),
(200, '경상남도', '창원시 의창구'),
(201, '경상남도', '창원시 성산구'),
(202, '경상남도', '창원시 마산합포구'),
(203, '경상남도', '창원시 마산회원구'),
(204, '경상남도', '창원시 진해구'),
(205, '경상남도', '진주시'),
(206, '경상남도', '통영시'),
(207, '경상남도', '사천시'),
(208, '경상남도', '김해시'),
(209, '경상남도', '밀양시'),
(210, '경상남도', '거제시'),
(211, '경상남도', '양산시'),
(212, '경상남도', '의령군'),
(213, '경상남도', '함안군'),
(214, '경상남도', '창녕군'),
(215, '경상남도', '고성군'),
(216, '경상남도', '남해군'),
(217, '경상남도', '하동군'),
(218, '경상남도', '산청군'),
(219, '경상남도', '함양군'),
(220, '경상남도', '거창군'),
(221, '경상남도', '합천군'),
(222, '제주특별자치도', '제주시'),
(223, '제주특별자치도', '서귀포시'),
(224, '강원특별자치도', '춘천시'),
(225, '강원특별자치도', '원주시'),
(226, '강원특별자치도', '강릉시'),
(227, '강원특별자치도', '동해시'),
(228, '강원특별자치도', '태백시'),
(229, '강원특별자치도', '속초시'),
(230, '강원특별자치도', '삼척시'),
(231, '강원특별자치도', '홍천군'),
(232, '강원특별자치도', '횡성군'),
(233, '강원특별자치도', '영월군'),
(234, '강원특별자치도', '평창군'),
(235, '강원특별자치도', '정선군'),
(236, '강원특별자치도', '철원군'),
(237, '강원특별자치도', '화천군'),
(238, '강원특별자치도', '양구군'),
(239, '강원특별자치도', '인제군'),
(240, '강원특별자치도', '고성군'),
(241, '강원특별자치도', '양양군'),
(242, '전북특별자치도', '전주시 완산구'),
(243, '전북특별자치도', '전주시 덕진구'),
(244, '전북특별자치도', '군산시'),
(245, '전북특별자치도', '익산시'),
(246, '전북특별자치도', '정읍시'),
(247, '전북특별자치도', '남원시'),
(248, '전북특별자치도', '김제시'),
(249, '전북특별자치도', '완주군'),
(250, '전북특별자치도', '진안군'),
(251, '전북특별자치도', '무주군'),
(252, '전북특별자치도', '장수군'),
(253, '전북특별자치도', '임실군'),
(254, '전북특별자치도', '순창군'),
(255, '전북특별자치도', '고창군'),
(256, '전북특별자치도', '부안군');

-- --------------------------------------------------------

--
-- 테이블 구조 `member`
--

CREATE TABLE `member` (
  `member_id` int(11) NOT NULL,
  `password` varchar(255) DEFAULT NULL,
  `tel` varchar(15) NOT NULL,
  `rating` double DEFAULT NULL,
  `bank_name` varchar(10) NOT NULL,
  `id` varchar(20) NOT NULL,
  `bank_num` varchar(20) NOT NULL,
  `name` varchar(20) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `email` varchar(30) DEFAULT NULL,
  `juso1` varchar(20) DEFAULT NULL,
  `juso2` varchar(20) DEFAULT NULL,
  `juso3` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `status` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `member`
--

INSERT INTO `member` (`member_id`, `password`, `tel`, `rating`, `bank_name`, `id`, `bank_num`, `name`, `birthday`, `email`, `juso1`, `juso2`, `juso3`, `image`, `status`) VALUES
(4, '$2y$12$OcvXRKBAu35X7Cxvx2/M5OocZNv2sVyvw7GqDC9e8OzWBBdDkZE7e', '01011111231', NULL, '우리', 'aaa', '1231231', 'aaa123', '2026-06-18', 'abc123@naver.com', '인천광역시', '영종구', '12313212', NULL, 0),
(5, '$2y$12$ux5hw2AvwgydRiwJf53EBOX8DdwX0em.4f8FF8wV21hYa4YmmfmfS', '01066665678', NULL, '우리', 'qwer', '12331231', '가가', '2026-07-15', '111', '경기도', '고양시 일산동구', 'ㄱㄴ동', NULL, 0),
(6, '$2y$12$i6byuPiAAAf3vByeWR2sCe5WaAIontEHwUZRtBsOXfMiZ8B4BSD0y', '01056782222', 4, '기업', 'qwer1234', '2132131232131', 'aa', '2026-07-09', '111', '서울특별시', '노원구', 'xx동', NULL, 1),
(7, '$2y$12$50E22ENZ/CUPfh8yg5VdkOpdMYiSyMXKIl9Xaes3DUzIKymDapOtC', '01011112222', NULL, '하나', 'ㅁㅁㅁㅁㅁ', '123123123', 'ㅁㅁㅁ', '2026-07-15', 'sanss11@naver.com', '서울특별시', '중구', 'ㅂㅂㅂ', NULL, 0),
(9, '$2y$12$JiXl0e4z4iCoz8DEu679qOZQg.jZVSvE8Dav6bzuOYjrQaJWmuhka', '01066661111', 3, '하나', 'aa', '1231231', '가가', '2026-07-02', '111', '서울특별시', '노원구', 'qweqwe', '', 0),
(10, '$2y$12$1S9IC0faDRXImCKtelnrtOtRQoeEvaTg/B2AGEf5N63R3auDPmZwq', '01011112222', 4, '신한', 'sj', '111123', 'ㅁㅁㅁ', '2026-07-15', 'sj1212@gmail.com', '경기도', '구리시', '1111', 'member10.png', 0),
(11, '$2y$12$GL92SxcpyRh8I3K8q4EJTut8ylmqMxG.giv27wJyciT5iZdpSpIxi', '01056786666', NULL, '신한', '정공성', '123123123', '정공', '2026-07-07', 'sdsadasd', '서울특별시', '중구', 'aㅁㅁㅁ', 'member11.png', 0),
(13, '$2y$12$NpZiwb/Pgz.ZzDTyTpXybuewSWukFh94Bc/8LNn2VR2DBbpko6YKO', '026666666', NULL, '국민', '123123', '12312312', 'qweqwe', '2026-08-04', 'qweqwe@gmail.com', '서울특별시', '노원구', '12321312', '', NULL),
(14, '$2y$12$N4dsD2JlcEVLEsC3mDpN1OPMTvLZu9ar.VADckLTrskBkZIlM.DyG', '02 77771111', NULL, '기업', '11111', '123123123', '123', '2026-07-26', '11111@gmail.com', '경기도', '수원시 장안구', '12312312', 'chat33.png', NULL),
(15, '$2y$12$fdEs2Y9rndmm9OHnBI37aeE1f0yIhKBZzwPjdfxc8S8Isx5tZhSae', '021231123', 5, '기업', '123', '123123', '가가', '2026-08-05', '111', '충청남도', '천안시 동남구', '131231', 'member15.png', NULL),
(17, '$2y$12$JSlBkNPKARDDVb8JFW2Wie12CLRYwOiTQPccZ0w5HrVAYo8G1nGRK', '01011222222', NULL, '기업', '1234', '1231231', '1234', '2026-08-05', '132313123', '경상북도', '포항시 남구', '123132', '', NULL),
(18, '$2y$12$TFMmqJ5EgKpk8iFTkz9Eo.IVUi0HHMF8pGC1JOEnoowqCdgPMDSPG', '1  1   1   ', NULL, '국민', '1111', '1', '1', '0011-01-01', '1', '서울특별시', '노원구', '1', '', NULL),
(19, '$2y$12$C29hSISCXWydEvP2xjvfdOONYbb2QfClXaJoDcr9ySVARIJyeHdau', '01011111111', 5, '국민', '1', '1', '유상준', '2004-01-01', '1', '서울특별시', '노원구', '1', '', NULL),
(20, '$2y$12$tZhxNdZzYuh9AOm3T6.CDurg9cGBtmZMD4m4WI4oJAysWpVGULUEi', '01011111111', NULL, '국민', 'woo03', '111111111111', '허유정', '2003-01-01', '1111', '서울특별시', '노원구', '노원구청', 'member20.jpg', 0);

-- --------------------------------------------------------

--
-- 테이블 구조 `orders`
--

CREATE TABLE `orders` (
  `order_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `buyer_id` int(11) NOT NULL,
  `reg_date` datetime NOT NULL,
  `seller_id` int(11) DEFAULT NULL,
  `method` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `orders`
--

INSERT INTO `orders` (`order_id`, `product_id`, `buyer_id`, `reg_date`, `seller_id`, `method`) VALUES
(3, 16, 10, '2026-07-27 11:36:34', 6, 0),
(4, 21, 10, '2026-07-27 11:36:34', 9, 0),
(7, 19, 7, '2026-07-27 11:37:03', 10, 0),
(8, 20, 5, '2026-07-27 11:37:03', 10, 0),
(10, 23, 10, '2026-08-11 18:47:53', 11, 1),
(11, 19, 13, '2026-08-14 15:54:56', 10, 0),
(12, 27, 13, '2026-08-14 16:02:28', 15, 0),
(13, 28, 18, '2026-08-19 16:12:49', 19, 1),
(14, 29, 18, '2026-08-23 22:22:43', 19, 0);

-- --------------------------------------------------------

--
-- 테이블 구조 `product`
--

CREATE TABLE `product` (
  `product_id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `image` varchar(255) NOT NULL,
  `price` int(11) NOT NULL,
  `memo` text NOT NULL,
  `category` tinyint(4) NOT NULL,
  `view` int(11) NOT NULL DEFAULT 0,
  `reg_date` datetime NOT NULL,
  `state` tinyint(4) NOT NULL,
  `juso1` varchar(20) DEFAULT NULL,
  `juso2` varchar(20) DEFAULT NULL,
  `juso3` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `product`
--

INSERT INTO `product` (`product_id`, `member_id`, `image`, `price`, `memo`, `category`, `view`, `reg_date`, `state`, `juso1`, `juso2`, `juso3`, `name`) VALUES
(16, 6, '', 30000, '12321312', 3, 0, '2026-07-27 15:57:23', 2, '서울특별시', '노원구', 'asdas', 'aa'),
(18, 6, 'image18.jpg', 50000, 'ㅇㅇㅇㅇㅇ', 5, 0, '2026-07-27 16:46:54', 2, '강원특별자치도', '홍천군', 'ㅁㅁㅁㅁ리', '게임팩'),
(19, 10, 'image19.png', 500000, '급처합니다', 4, 4, '2026-07-27 20:30:01', 2, '경기도', '구리시', 'XX아파트 앞', '스위치2'),
(20, 10, 'image20.jpg', 600000, '생활 기스 있음', 1, 0, '2026-07-27 20:31:50', 2, '서울특별시', '노원구', '노원역 부근', '아이폰 15 공기계'),
(23, 11, 'image23.png', 500, '샘플이고 한장당 500원이요', 6, 18, '2026-07-30 17:40:31', 2, '서울특별시', '중구', 'ㅂㅂㅂ', '집냥이 사진'),
(25, 6, '', 30000, '선반 팝니다. 관심있으면 채팅 주세요.', 2, 8, '2026-07-30 23:40:05', 0, '서울특별시', '도봉구', 'xx동', '선반'),
(26, 15, 'image26.png', 300000, '40인치 tv 급처합니다.', 1, 18, '2026-08-14 15:59:15', 0, '충청남도', '천안시 동남구', '131231', 'TV'),
(27, 15, 'image27.png', 100000, '13312132', 1, 1, '2026-08-14 16:00:19', 2, '충청남도', '천안시 동남구', '131231', 'aa'),
(28, 19, 'image28.png', 500000, '삼성 티비입니다', 1, 1, '2026-08-19 16:12:13', 2, '서울특별시', '노원구', '1', '삼성tv입니다'),
(29, 19, 'image29.png', 500000, '1', 3, 1, '2026-08-23 22:22:16', 2, '서울특별시', '노원구', '1', 'tvtv'),
(31, 20, 'image31.jpg', 100000, '실사용 거의 없는 에어팟 팔아요 사용감 거의 없어요 직거래 좋아요', 1, 0, '2026-08-26 20:11:33', 0, '서울특별시', '노원구', '노원구청', '에어팟 팔아요'),
(32, 20, 'image32.jpg', 200000, '이사 가게 되어서 가구 정리해요 어디에도 잘 어울리는 옷장이에요', 2, 0, '2026-08-26 20:12:50', 0, '서울특별시', '노원구', '인덕대학교', '옷장'),
(35, 20, 'image35.png', 310000, 's급 공기계 팔아요 구매 한지 얼마 안 되었는데 다른 핸드폰을 받게 되어서 판매해요 쿨거래시 만원할인', 1, 0, '2026-08-26 20:19:04', 0, '서울특별시', '노원구', '노원구청', '삼성 핸드폰 팔아요'),
(36, 20, 'image36.jpg', 100000, '급전이 필요해서 커세어 헤드셋 싸게 팔아요 내고 환영', 1, 0, '2026-08-26 20:20:46', 0, '서울특별시', '노원구', '상계역', '커세어 헤드셋'),
(37, 20, 'image37.jpg', 100000, '아디아스 신발 팔아요', 4, 0, '2026-08-26 20:22:53', 0, '서울특별시', '노원구', '공릉역', '아디다스 신발'),
(38, 20, 'image38.jpg', 50000, '운동화 싸게 팔아요 실착 3번 있어요', 4, 0, '2026-08-26 20:23:39', 0, '서울특별시', '노원구', '공릉역', '운동화'),
(39, 20, 'image39.jpg', 70000, '색감 좋은 니트 팔아요 직거래는 상계역에서만 합니다', 4, 0, '2026-08-26 20:24:48', 0, '서울특별시', '노원구', '상계역', '니트'),
(40, 20, 'image40.jpg', 500000, '지금까지 모은 게임팩 팔아요 게임을 안하게 되서 한번에 처리 합니다', 5, 0, '2026-08-26 20:27:31', 0, '서울특별시', '노원구', '하계역', '게임팩'),
(41, 20, 'image41.jpg', 200000, '스위치 판매해요', 5, 0, '2026-08-26 20:28:23', 0, '서울특별시', '노원구', '노원 세무소', '스위치'),
(42, 20, 'image42.jpg', 200000, '플스 판매해요 관심있으신 분들 채팅 주세요', 5, 0, '2026-08-26 20:29:01', 0, '서울특별시', '노원구', '노원구청', '플스'),
(43, 20, 'image43.jpg', 1000000, '삼성 갤럭시북 팔아요 성능 좋고 점검 받았어', 1, 0, '2026-08-26 20:35:38', 0, '서울특별시', '도봉구', '도봉구청', '노트북'),
(44, 20, 'image44.jpg', 700000, '3070 pc 팔아요 상태는 직접 확인하셔도 되요', 1, 0, '2026-08-26 20:36:56', 0, '서울특별시', '도봉구', '방학역', '데스크탑'),
(45, 20, 'image45.jpg', 20000, '로지텍 게이밍 마우스입니다 한달정도 사용하다 다른 마우스가 생겨서 팔아요', 1, 0, '2026-08-26 20:38:04', 0, '서울특별시', '도봉구', '창동역', '로지텍 마우스'),
(46, 20, 'image46.jpg', 200000, 'lg 모니터 입니다 240hz', 1, 0, '2026-08-26 20:39:27', 0, '서울특별시', '강북구', '강북구청', '모니터'),
(47, 20, 'image47.jpg', 130000, '갤럭시 워치 46mm 팔아요 상태 좋아요 환불 어려워요', 1, 0, '2026-08-26 20:40:54', 0, '서울특별시', '강북구', '수유역', '스마트워치'),
(48, 20, 'image48.jpg', 30000, '새상품 이어폰 입니다 거래 문의 해주세요', 1, 0, '2026-08-26 20:42:07', 0, '서울특별시', '성북구', '꿈의숲', '이어폰'),
(49, 20, 'image49.jpg', 50000, '게이밍 키보드 입니다 적축으로 호불호 없는 상품이에요 채팅 주세요', 1, 0, '2026-08-26 20:43:03', 0, '서울특별시', '노원구', '노원구청', '키보드'),
(50, 20, 'image50.jpg', 500000, '사용기간 1달 상태 양호', 1, 0, '2026-08-26 20:44:44', 0, '서울특별시', '도봉구', '창동역', '태플릿'),
(51, 20, 'image51.jpg', 20000, '가습기 건조한곳에 두면 좋아요', 3, 0, '2026-08-26 20:53:48', 0, '서울특별시', '노원구', '노원구청', '가습기'),
(52, 20, 'image52.jpg', 150000, '요즘처럼 공기 안좋을때 필수이 공기청정기 팔아요', 3, 0, '2026-08-26 20:54:43', 0, '서울특별시', '노원구', '노원구청', '공기청정기'),
(53, 20, 'image53.jpg', 18000, '집에서 사용하기 좋은 선풍기 입니다', 3, 0, '2026-08-26 20:55:23', 0, '서울특별시', '노원구', '노원구청', '선풍기'),
(54, 20, 'image54.jpg', 480000, '드럼세탁기입니다 이사가면서 정리하게 되어 판매해요', 3, 0, '2026-08-26 20:57:47', 0, '서울특별시', '노원구', '노원구청', '드럼세탁기'),
(55, 20, 'image55.jpg', 180000, '에어컨 팔아요 시원한 여름이 될 수 있어요', 3, 0, '2026-08-26 20:58:52', 0, '서울특별시', '도봉구', '창동역', '에어컨'),
(56, 20, 'image56.jpg', 45000, '요리 할 때 편리한 에어프라이어 팝니다', 3, 0, '2026-08-26 20:59:35', 0, '서울특별시', '도봉구', '도봉구청', '에어프라이어'),
(57, 20, 'image57.jpg', 170000, '전자레인지 팔아요 상태 좋고 구매한지 얼마 안된 상품입니다', 3, 0, '2026-08-26 21:01:06', 0, '서울특별시', '성북구', '성북구청', '전자레인지'),
(58, 20, 'image58.jpg', 23000, '습한 곳에 있으면 좋은 제습기 입니다 상태 보시고 결정하셔도 됩니다', 3, 0, '2026-08-26 21:02:42', 0, '서울특별시', '강북구', '강북구청', '제습기'),
(59, 20, 'image59.jpg', 140000, '청소할때 필수인 청소기입니다 자취생이나 청소가 필요하신 분들에게 추천해요', 3, 0, '2026-08-26 21:04:15', 0, '서울특별시', '강북구', '강북구청', '청소기'),
(60, 20, 'image60.jpg', 30000, '가정에서 쓰기 좋은 드라이기 입니다', 3, 0, '2026-08-26 21:05:05', 0, '서울특별시', '도봉구', '창동역', '헤어드라이기'),
(61, 20, 'image61.jpg', 43000, '화장할때나 옷확인할때 좋은 거울입니다 직거래는 노원구청 앞에서만 가능해요', 2, 0, '2026-08-26 21:08:44', 0, '서울특별시', '노원구', '노원구청', '거울'),
(62, 20, 'image62.jpg', 330000, '어디에든 어울리는 흰색 소파입니다 쿨거래서 만원 할인해드려요', 2, 0, '2026-08-26 21:09:57', 0, '서울특별시', '성북구', '성북구청', '소파'),
(63, 20, 'image63.jpg', 40000, '짐정리 할때 좋은 수납장입니다', 2, 0, '2026-08-26 21:10:39', 0, '서울특별시', '강북구', '강북구청', '수납장'),
(64, 20, 'image64.jpg', 12000, '외출하기 전에 확인하기 좋은 거울 입니다', 2, 0, '2026-08-26 21:11:43', 0, '서울특별시', '도봉구', '도봉구청', '전신거울'),
(67, 20, 'image67.jpg', 800000, '명품가방입니다 보증서 있고 직거래로 확인해보셔도 됩니다', 4, 0, '2026-08-26 21:19:10', 0, '서울특별시', '노원구', '노원구청', '가방'),
(68, 20, 'image68.jpg', 32000, '긴팔티셔츠입니다 쿨거래시 3만원에 가능합니다', 4, 0, '2026-08-26 21:19:53', 0, '서울특별시', '도봉구', '창동역', '긴팔티'),
(69, 20, 'image69.jpg', 22000, '어디에든 무난한 모자입니다', 4, 0, '2026-08-26 21:20:42', 0, '서울특별시', '성북구', '북서울 꿈의숲', '모자'),
(70, 20, 'image70.jpg', 15000, '실사용 없는 새상품입니다', 4, 0, '2026-08-26 21:21:23', 0, '서울특별시', '강북구', '강북구청', '반팔'),
(71, 20, 'image71.jpg', 65000, '학생들이 좋아할만한 백팩 입니다 새학기 선물로도 훌륭해요', 4, 0, '2026-08-26 21:22:22', 0, '서울특별시', '노원구', '노원구청', '백팩'),
(72, 20, 'image72.jpg', 19000, '색감좋은 셔츠에요 막 입기좋아요 꾸안꾸 느낌 채팅주세요', 4, 0, '2026-08-26 21:23:23', 0, '서울특별시', '노원구', '노원구청', '셔츠'),
(73, 20, 'image73.jpg', 30000, '슬랙스 바지 입니다', 4, 0, '2026-08-26 21:24:07', 0, '서울특별시', '도봉구', '도봉구청', '슬랙스 바지'),
(74, 20, 'image74.jpg', 35000, '스타일 좋은 원피스에요 직접 입어보고 결정하셔도 됩니다 환불은 어려워요', 4, 0, '2026-08-26 21:25:04', 0, '서울특별시', '노원구', '노원구청', '원피스'),
(75, 20, 'image75.jpg', 70000, '선물받았는데 사이즈가 맞지 않아서 판매해요 한번 입어보고 안 맞아서 거의 새상품입니다', 4, 0, '2026-08-26 21:26:07', 0, '서울특별시', '성북구', '성북구청', '청바지'),
(76, 20, 'image76.jpg', 100000, '롯데백화점 앞에서 직거래만 합니다 편하게 입어보시고 결정해주세요 내고는 어려워요', 4, 0, '2026-08-26 21:27:01', 0, '서울특별시', '노원구', '롯데백화점', '패딩'),
(77, 20, 'image77.jpg', 140000, '편안한 매트리스 입니다', 2, 0, '2026-08-26 21:39:15', 0, '서울특별시', '노원구', '노원구청', '매트리스'),
(78, 20, 'image78.jpg', 90000, '공부할때 써도 좋고 컴퓨터 사용할때 써도 좋은 다용도 책상이에요 편하게 연락주세요', 2, 0, '2026-08-26 21:40:11', 0, '서울특별시', '노원구', '노원구청', '책상'),
(79, 20, 'image79.jpg', 380000, '침대입니다 이사가면서 판매해요', 2, 0, '2026-08-26 21:41:02', 0, '서울특별시', '강북구', '강북구청', '침대'),
(80, 20, 'image80.jpg', 200000, '침대입니다 편하게 채팅주세요', 2, 0, '2026-08-26 21:41:56', 0, '서울특별시', '성북구', '북서울 꿈의숲', '침대입니다'),
(81, 20, 'image81.jpg', 70000, 'vr 게임기 입니다', 5, 0, '2026-08-26 21:46:32', 0, '서울특별시', '노원구', '노원구청', 'vr'),
(82, 20, 'image82.jpg', 280000, 'xbox 게임기 입니다', 5, 0, '2026-08-26 21:47:10', 0, '서울특별시', '성북구', '성북구청', 'xbox'),
(83, 20, 'image83.jpg', 130000, '추억의 닌텐도 입니다 잘 작동 됩니다 고장이나 문제 없습니다 채팅 주세요', 5, 0, '2026-08-26 21:48:10', 0, '서울특별시', '강북구', '수유역', '닌텐도'),
(84, 20, 'image84.jpg', 100000, '어렸을때 많이 했던 미니게임기 입니다 아이들도 좋아서 선물로도 좋아요', 5, 0, '2026-08-26 21:49:00', 0, '서울특별시', '도봉구', '창동역', '미니게임기'),
(85, 20, 'image85.jpg', 30000, '이미 다 해봐서 판매합니다', 5, 0, '2026-08-26 21:49:32', 0, '서울특별시', '노원구', '노원구청', '스위치칩'),
(86, 20, 'image86.jpg', 50000, '집에 하나가 남아서 판매합니다', 5, 0, '2026-08-26 21:49:54', 0, '서울특별시', '노원구', '노원구청', '컨트롤러'),
(87, 20, 'image87.jpg', 30000, '사이버 펑크 cd 입니다', 5, 0, '2026-08-26 21:54:46', 0, '서울특별시', '노원구', '노원구청', '사이버펑크'),
(88, 20, 'image88.jpg', 40000, '스위치 인기 시리지 중 하나인 동물의 숲입니다', 5, 0, '2026-08-26 21:55:31', 0, '서울특별시', '노원구', '노원구청', '스위치 동물의 숲'),
(89, 20, 'image89.jpg', 30000, '스위치 젤다의 전설입니다', 5, 0, '2026-08-26 21:56:02', 0, '서울특별시', '강북구', '강북구청', '젤다의 전설'),
(90, 20, 'image90.jpg', 40000, '6인분 전기 밥솥입니다 온 가족이 써도 충분해요', 3, 0, '2026-08-26 21:59:35', 0, '서울특별시', '성북구', '수유역', '밥솥'),
(91, 20, 'image91.jpg', 100000, '정수기입니다 가전에 쓰기 좋은 정수기입니다 좋은가격에 가져가세요', 3, 0, '2026-08-26 22:01:00', 0, '서울특별시', '노원구', '노원구청', '정수기'),
(92, 20, 'image92.jpg', 600000, '아이폰 최신 공기계 입니다.', 1, 0, '2026-08-26 22:04:11', 0, '서울특별시', '도봉구', '창동역', '아이폰'),
(93, 20, 'image93.jpg', 550000, '검은색 소파입니다', 2, 0, '2026-08-26 22:07:30', 0, '서울특별시', '노원구', '노원구청', '소파'),
(94, 20, 'image94.jpg', 200000, '여닫이 옷장입니다', 2, 0, '2026-08-26 22:08:27', 0, '서울특별시', '도봉구', '창동역', '여닫이 옷장'),
(95, 20, 'image95.jpg', 10000, '야외에서도 좋고 집 안에서도 쓰기 좋은 의자 입니다 직접 보시고 결정하셔도 좋습니다', 2, 0, '2026-08-26 22:09:19', 0, '서울특별시', '노원구', '노원구청', '의자'),
(97, 20, 'image97.jpg', 30000, '만년필입니다', 6, 0, '2026-08-26 22:19:06', 0, '서울특별시', '노원구', '노원구청', '만년필'),
(98, 20, 'image98.jpg', 300000, '자전거입니다 정비 마쳐서 바로 주행가능합니다', 6, 0, '2026-08-26 22:19:44', 0, '서울특별시', '강북구', '노원구청', '로드자전거'),
(99, 20, 'image99.jpg', 1000, '전과과목교재 입니다', 6, 0, '2026-08-26 22:20:58', 0, '서울특별시', '노원구', '인덕대학교', '컴소과 전공책'),
(100, 20, 'image100.jpg', 5000, '계산기 입니다', 6, 0, '2026-08-26 22:26:09', 0, '서울특별시', '강북구', '강북구청', '계산기'),
(101, 20, 'image101.jpg', 130000, '소리 좋은 기타입니다', 6, 0, '2026-08-26 22:26:56', 0, '서울특별시', '성북구', '북서울', '기타'),
(102, 20, 'image102.jpg', 70000, '아이들이 좋아하는 레고 입니다 미개봉 상품이니까 안심하고 가져가셔도 좋습니다', 6, 0, '2026-08-26 23:33:37', 0, '서울특별시', '노원구', '노원구청', '레고'),
(103, 20, 'image103.jpg', 100000, '초보자부터 상급자까지 사용 가능한 라켓 입니다', 6, 0, '2026-08-26 23:34:44', 0, '서울특별시', '노원구', '노원구청', '배드민턴라켓'),
(104, 20, 'image104.jpg', 10000, '5kg 아령입니다 운동하시는 분들 싸게 가져가세요', 6, 0, '2026-08-26 23:36:04', 0, '서울특별시', '도봉구', '방학역', '아령'),
(105, 20, 'image105.jpg', 200000, '2인 영화 티켓입니다 인당 만원으로 판매합니다', 6, 0, '2026-08-26 23:37:14', 0, '서울특별시', '성북구', '성북구청', '영화티켓 2매'),
(106, 20, 'image106.jpg', 5000, '1000피스 퍼즐입니다 적당한 난이도로 누구나 즐길 수 있는 퍼즐입니다', 6, 0, '2026-08-26 23:41:56', 0, '서울특별시', '노원구', '노원구청', '퍼즐'),
(107, 20, 'image107.jpg', 100000, '요즘 인기 많은 포켓몬 카드입니다 미개봉 상품으로 직거래로 확인해보시고 결정해 주세요', 6, 0, '2026-08-26 23:43:00', 0, '서울특별시', '도봉구', '창동역', '포켓몬 카드'),
(108, 20, 'image108.jpg', 13000, '가정에서 쓰기 좋은 후라이팬입니다', 6, 0, '2026-08-26 23:43:42', 0, '서울특별시', '노원구', '공릉역', '후라이팬');

-- --------------------------------------------------------

--
-- 테이블 구조 `rating`
--

CREATE TABLE `rating` (
  `rating_id` int(11) NOT NULL,
  `to_member_id` int(11) NOT NULL,
  `from_member_id` int(11) NOT NULL,
  `score` double NOT NULL,
  `reg_date` datetime NOT NULL,
  `order_id` int(11) DEFAULT NULL,
  `memo` text DEFAULT NULL,
  `product_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `rating`
--

INSERT INTO `rating` (`rating_id`, `to_member_id`, `from_member_id`, `score`, `reg_date`, `order_id`, `memo`, `product_id`) VALUES
(2, 10, 7, 5, '2026-07-27 11:38:53', 7, NULL, 19),
(3, 10, 5, 3, '2026-07-27 11:39:38', 8, NULL, 20),
(8, 6, 10, 4, '2026-08-11 15:07:12', 3, '312312312312', 16),
(9, 9, 10, 3, '2026-08-11 15:09:23', 4, 'ADASDAS', 21),
(10, 15, 13, 5, '2026-08-14 16:03:02', 12, '쿨거래 ㄱㅅ요', 27),
(11, 19, 18, 5, '2026-08-19 16:13:01', 13, '쿨 거래 감사합니다', 28),
(12, 19, 18, 5, '2026-08-23 22:24:03', 14, '좋은 거래 감사합니다 상품도 좋고 판매자 분도 엄청 친절해요', 29);

-- --------------------------------------------------------

--
-- 테이블 구조 `report`
--

CREATE TABLE `report` (
  `report_id` int(11) NOT NULL,
  `to_member_id` int(11) NOT NULL,
  `from_member_id` int(11) NOT NULL,
  `reason` int(11) NOT NULL,
  `text` text NOT NULL,
  `image` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `report`
--

INSERT INTO `report` (`report_id`, `to_member_id`, `from_member_id`, `reason`, `text`, `image`) VALUES
(2, 10, 11, 2, 'asddas', ''),
(3, 10, 11, 2, 'qadsdas', ''),
(6, 10, 9, 2, 'dasdsadaasd', 'report6.png'),
(7, 6, 10, 1, 'asdasasd', 'report7.png'),
(8, 6, 10, 2, 'qwewqeqw', '');

-- --------------------------------------------------------

--
-- 테이블 구조 `reportedmember`
--

CREATE TABLE `reportedmember` (
  `id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `reason` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `reportedmember`
--

INSERT INTO `reportedmember` (`id`, `member_id`, `reason`) VALUES
(1, 6, 1);

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `chat`
--
ALTER TABLE `chat`
  ADD PRIMARY KEY (`chat_id`);

--
-- 테이블의 인덱스 `good`
--
ALTER TABLE `good`
  ADD PRIMARY KEY (`good_id`);

--
-- 테이블의 인덱스 `juso`
--
ALTER TABLE `juso`
  ADD PRIMARY KEY (`id`);

--
-- 테이블의 인덱스 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`member_id`);

--
-- 테이블의 인덱스 `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`order_id`);

--
-- 테이블의 인덱스 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`product_id`);

--
-- 테이블의 인덱스 `rating`
--
ALTER TABLE `rating`
  ADD PRIMARY KEY (`rating_id`);

--
-- 테이블의 인덱스 `report`
--
ALTER TABLE `report`
  ADD PRIMARY KEY (`report_id`);

--
-- 테이블의 인덱스 `reportedmember`
--
ALTER TABLE `reportedmember`
  ADD PRIMARY KEY (`id`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `chat`
--
ALTER TABLE `chat`
  MODIFY `chat_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;

--
-- 테이블의 AUTO_INCREMENT `good`
--
ALTER TABLE `good`
  MODIFY `good_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- 테이블의 AUTO_INCREMENT `juso`
--
ALTER TABLE `juso`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=257;

--
-- 테이블의 AUTO_INCREMENT `member`
--
ALTER TABLE `member`
  MODIFY `member_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- 테이블의 AUTO_INCREMENT `orders`
--
ALTER TABLE `orders`
  MODIFY `order_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- 테이블의 AUTO_INCREMENT `product`
--
ALTER TABLE `product`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=109;

--
-- 테이블의 AUTO_INCREMENT `rating`
--
ALTER TABLE `rating`
  MODIFY `rating_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- 테이블의 AUTO_INCREMENT `report`
--
ALTER TABLE `report`
  MODIFY `report_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- 테이블의 AUTO_INCREMENT `reportedmember`
--
ALTER TABLE `reportedmember`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
