-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- 호스트: localhost
-- 생성 시간: 26-07-22 07:57
-- 서버 버전: 12.3.2-MariaDB
-- PHP 버전: 8.5.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `market`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `chat`
--

CREATE TABLE `chat` (
  `chat_id` int(11) NOT NULL,
  `to_member_id` int(11) NOT NULL,
  `from_member_id` int(11) NOT NULL,
  `text` text NOT NULL,
  `reg_date` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- 테이블 구조 `juso`
--

CREATE TABLE `juso` (
  `id` int(11) NOT NULL,
  `juso1` varchar(20) NOT NULL,
  `juso2` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `juso`
--

INSERT INTO `juso` (`id`, `juso1`, `juso2`) VALUES
(1, '서울특별시', '중구'),
(2, '서울특별시', '종로구'),
(3, '서울특별시', '용산구'),
(4, '서울특별시', '성동구'),
(5, '서울특별시', '광진구'),
(6, '서울특별시', '동대문구'),
(7, '서울특별시', '중랑구'),
(8, '서울특별시', '성북구'),
(9, '서울특별시', '강북구'),
(10, '서울특별시', '도봉구'),
(11, '서울특별시', '노원구'),
(12, '서울특별시', '은평구'),
(13, '서울특별시', '서대문구'),
(14, '서울특별시', '마포구'),
(15, '서울특별시', '양천구'),
(16, '서울특별시', '강서구'),
(17, '서울특별시', '구로구'),
(18, '서울특별시', '금천구'),
(19, '서울특별시', '영등포구'),
(20, '서울특별시', '동작구'),
(21, '서울특별시', '관악구'),
(22, '서울특별시', '서초구'),
(23, '서울특별시', '강남구'),
(24, '서울특별시', '송파구'),
(25, '서울특별시', '강동구'),
(26, '전남광주통합특별시', '목포시'),
(27, '전남광주통합특별시', '여수시'),
(28, '전남광주통합특별시', '순천시'),
(29, '전남광주통합특별시', '나주시'),
(30, '전남광주통합특별시', '광양시'),
(31, '전남광주통합특별시', '동구'),
(32, '전남광주통합특별시', '서구'),
(33, '전남광주통합특별시', '남구'),
(34, '전남광주통합특별시', '북구'),
(35, '전남광주통합특별시', '광산구'),
(36, '전남광주통합특별시', '담양군'),
(37, '전남광주통합특별시', '곡성군'),
(38, '전남광주통합특별시', '구례군'),
(39, '전남광주통합특별시', '고흥군'),
(40, '전남광주통합특별시', '보성군'),
(41, '전남광주통합특별시', '화순군'),
(42, '전남광주통합특별시', '장흥군'),
(43, '전남광주통합특별시', '강진군'),
(44, '전남광주통합특별시', '해남군'),
(45, '전남광주통합특별시', '영암군'),
(46, '전남광주통합특별시', '무안군'),
(47, '전남광주통합특별시', '함평군'),
(48, '전남광주통합특별시', '영광군'),
(49, '전남광주통합특별시', '장성군'),
(50, '전남광주통합특별시', '완도군'),
(51, '전남광주통합특별시', '진도군'),
(52, '전남광주통합특별시', '신안군'),
(53, '부산광역시', '중구'),
(54, '부산광역시', '서구'),
(55, '부산광역시', '동구'),
(56, '부산광역시', '영도구'),
(57, '부산광역시', '부산진구'),
(58, '부산광역시', '동래구'),
(59, '부산광역시', '남구'),
(60, '부산광역시', '북구'),
(61, '부산광역시', '해운대구'),
(62, '부산광역시', '사하구'),
(63, '부산광역시', '금정구'),
(64, '부산광역시', '강서구'),
(65, '부산광역시', '연제구'),
(66, '부산광역시', '수영구'),
(67, '부산광역시', '사상구'),
(68, '부산광역시', '기장군'),
(69, '대구광역시', '중구'),
(70, '대구광역시', '동구'),
(71, '대구광역시', '서구'),
(72, '대구광역시', '남구'),
(73, '대구광역시', '북구'),
(74, '대구광역시', '수성구'),
(75, '대구광역시', '달서구'),
(76, '대구광역시', '달성군'),
(77, '대구광역시', '군위군'),
(78, '인천광역시', '제물포구'),
(79, '인천광역시', '영종구'),
(80, '인천광역시', '미추홀구'),
(81, '인천광역시', '연수구'),
(82, '인천광역시', '남동구'),
(83, '인천광역시', '부평구'),
(84, '인천광역시', '계양구'),
(85, '인천광역시', '서해구'),
(86, '인천광역시', '검단구'),
(87, '인천광역시', '강화군'),
(88, '인천광역시', '옹진군'),
(89, '대전광역시', '동구'),
(90, '대전광역시', '중구'),
(91, '대전광역시', '서구'),
(92, '대전광역시', '유성구'),
(93, '대전광역시', '대덕구'),
(94, '울산광역시', '중구'),
(95, '울산광역시', '남구'),
(96, '울산광역시', '동구'),
(97, '울산광역시', '북구'),
(98, '울산광역시', '울주군'),
(99, '세종특별자치시', '세종특별자치시'),
(100, '경기도', '수원시 장안구'),
(101, '경기도', '수원시 권선구'),
(102, '경기도', '수원시 팔달구'),
(103, '경기도', '수원시 영통구'),
(104, '경기도', '성남시 수정구'),
(105, '경기도', '성남시 중원구'),
(106, '경기도', '성남시 분당구'),
(107, '경기도', '의정부시'),
(108, '경기도', '안양시 만안구'),
(109, '경기도', '안양시 동안구'),
(110, '경기도', '부천시 원미구'),
(111, '경기도', '부천시 소사구'),
(112, '경기도', '부천시 오정구'),
(113, '경기도', '광명시'),
(114, '경기도', '평택시'),
(115, '경기도', '동두천시'),
(116, '경기도', '안산시 상록구'),
(117, '경기도', '안산시 단원구'),
(118, '경기도', '고양시 덕양구'),
(119, '경기도', '고양시 일산동구'),
(120, '경기도', '고양시 일산서구'),
(121, '경기도', '과천시'),
(122, '경기도', '구리시'),
(123, '경기도', '남양주시'),
(124, '경기도', '오산시'),
(125, '경기도', '시흥시'),
(126, '경기도', '군포시'),
(127, '경기도', '의왕시'),
(128, '경기도', '하남시'),
(129, '경기도', '용인시 처인구'),
(130, '경기도', '용인시 기흥구'),
(131, '경기도', '용인시 수지구'),
(132, '경기도', '파주시'),
(133, '경기도', '이천시'),
(134, '경기도', '안성시'),
(135, '경기도', '김포시'),
(136, '경기도', '화성시 만세구'),
(137, '경기도', '화성시 효행구'),
(138, '경기도', '화성시 병점구'),
(139, '경기도', '화성시 동탄구'),
(140, '경기도', '광주시'),
(141, '경기도', '양주시'),
(142, '경기도', '포천시'),
(143, '경기도', '여주시'),
(144, '경기도', '연천군'),
(145, '경기도', '가평군'),
(146, '경기도', '양평군'),
(147, '충청북도', '청주시 상당구'),
(148, '충청북도', '청주시 서원구'),
(149, '충청북도', '청주시 흥덕구'),
(150, '충청북도', '청주시 청원구'),
(151, '충청북도', '충주시'),
(152, '충청북도', '제천시'),
(153, '충청북도', '보은군'),
(154, '충청북도', '옥천군'),
(155, '충청북도', '영동군'),
(156, '충청북도', '증평군'),
(157, '충청북도', '진천군'),
(158, '충청북도', '괴산군'),
(159, '충청북도', '음성군'),
(160, '충청북도', '단양군'),
(161, '충청남도', '천안시 동남구'),
(162, '충청남도', '천안시 서북구'),
(163, '충청남도', '공주시'),
(164, '충청남도', '보령시'),
(165, '충청남도', '아산시'),
(166, '충청남도', '서산시'),
(167, '충청남도', '논산시'),
(168, '충청남도', '계룡시'),
(169, '충청남도', '당진시'),
(170, '충청남도', '금산군'),
(171, '충청남도', '부여군'),
(172, '충청남도', '서천군'),
(173, '충청남도', '청양군'),
(174, '충청남도', '홍성군'),
(175, '충청남도', '예산군'),
(176, '충청남도', '태안군'),
(177, '경상북도', '포항시 남구'),
(178, '경상북도', '포항시 북구'),
(179, '경상북도', '경주시'),
(180, '경상북도', '김천시'),
(181, '경상북도', '안동시'),
(182, '경상북도', '구미시'),
(183, '경상북도', '영주시'),
(184, '경상북도', '영천시'),
(185, '경상북도', '상주시'),
(186, '경상북도', '문경시'),
(187, '경상북도', '경산시'),
(188, '경상북도', '의성군'),
(189, '경상북도', '청송군'),
(190, '경상북도', '영양군'),
(191, '경상북도', '영덕군'),
(192, '경상북도', '청도군'),
(193, '경상북도', '고령군'),
(194, '경상북도', '성주군'),
(195, '경상북도', '칠곡군'),
(196, '경상북도', '예천군'),
(197, '경상북도', '봉화군'),
(198, '경상북도', '울진군'),
(199, '경상북도', '울릉군'),
(200, '경상남도', '창원시 의창구'),
(201, '경상남도', '창원시 성산구'),
(202, '경상남도', '창원시 마산합포구'),
(203, '경상남도', '창원시 마산회원구'),
(204, '경상남도', '창원시 진해구'),
(205, '경상남도', '진주시'),
(206, '경상남도', '통영시'),
(207, '경상남도', '사천시'),
(208, '경상남도', '김해시'),
(209, '경상남도', '밀양시'),
(210, '경상남도', '거제시'),
(211, '경상남도', '양산시'),
(212, '경상남도', '의령군'),
(213, '경상남도', '함안군'),
(214, '경상남도', '창녕군'),
(215, '경상남도', '고성군'),
(216, '경상남도', '남해군'),
(217, '경상남도', '하동군'),
(218, '경상남도', '산청군'),
(219, '경상남도', '함양군'),
(220, '경상남도', '거창군'),
(221, '경상남도', '합천군'),
(222, '제주특별자치도', '제주시'),
(223, '제주특별자치도', '서귀포시'),
(224, '강원특별자치도', '춘천시'),
(225, '강원특별자치도', '원주시'),
(226, '강원특별자치도', '강릉시'),
(227, '강원특별자치도', '동해시'),
(228, '강원특별자치도', '태백시'),
(229, '강원특별자치도', '속초시'),
(230, '강원특별자치도', '삼척시'),
(231, '강원특별자치도', '홍천군'),
(232, '강원특별자치도', '횡성군'),
(233, '강원특별자치도', '영월군'),
(234, '강원특별자치도', '평창군'),
(235, '강원특별자치도', '정선군'),
(236, '강원특별자치도', '철원군'),
(237, '강원특별자치도', '화천군'),
(238, '강원특별자치도', '양구군'),
(239, '강원특별자치도', '인제군'),
(240, '강원특별자치도', '고성군'),
(241, '강원특별자치도', '양양군'),
(242, '전북특별자치도', '전주시 완산구'),
(243, '전북특별자치도', '전주시 덕진구'),
(244, '전북특별자치도', '군산시'),
(245, '전북특별자치도', '익산시'),
(246, '전북특별자치도', '정읍시'),
(247, '전북특별자치도', '남원시'),
(248, '전북특별자치도', '김제시'),
(249, '전북특별자치도', '완주군'),
(250, '전북특별자치도', '진안군'),
(251, '전북특별자치도', '무주군'),
(252, '전북특별자치도', '장수군'),
(253, '전북특별자치도', '임실군'),
(254, '전북특별자치도', '순창군'),
(255, '전북특별자치도', '고창군'),
(256, '전북특별자치도', '부안군');

-- --------------------------------------------------------

--
-- 테이블 구조 `member`
--

CREATE TABLE `member` (
  `member_id` int(11) NOT NULL,
  `password` varchar(16) NOT NULL,
  `address` varchar(255) NOT NULL,
  `tel` varchar(15) NOT NULL,
  `rating` double DEFAULT NULL,
  `bank_name` varchar(10) NOT NULL,
  `id` varchar(20) NOT NULL,
  `bank_num` varchar(20) NOT NULL,
  `name` varchar(20) DEFAULT NULL,
  `birthday` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `member`
--

INSERT INTO `member` (`member_id`, `password`, `address`, `tel`, `rating`, `bank_name`, `id`, `bank_num`, `name`, `birthday`) VALUES
(1, '1234', '서울 강남구 11', '010-1234-1234', NULL, '국민', 'aaa123', '123-12-1234', '홍길동', '2000-10-10');

-- --------------------------------------------------------

--
-- 테이블 구조 `orders`
--

CREATE TABLE `orders` (
  `order_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `buyer_id` int(11) NOT NULL,
  `reg_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

-- --------------------------------------------------------

--
-- 테이블 구조 `product`
--

CREATE TABLE `product` (
  `product_id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `image` varchar(255) NOT NULL,
  `price` int(11) NOT NULL,
  `memo` text NOT NULL,
  `category` tinyint(4) NOT NULL,
  `view` int(11) NOT NULL DEFAULT 0,
  `reg_date` datetime NOT NULL,
  `state` tinyint(4) NOT NULL,
  `juso1` varchar(20) DEFAULT NULL,
  `juso2` varchar(20) DEFAULT NULL,
  `juso3` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 테이블의 덤프 데이터 `product`
--

INSERT INTO `product` (`product_id`, `member_id`, `image`, `price`, `memo`, `category`, `view`, `reg_date`, `state`, `juso1`, `juso2`, `juso3`) VALUES
(4, 1, 'image4', 65700, 'ㅂㅈㄷㅂㅈㄷㅈㅂㄷㅂㅈㄷㅈㅂ', 2, 0, '2026-07-21 23:48:08', 0, NULL, NULL, NULL),
(5, 1, 'image5', 21500, '123414ㄴㄻㄴㄹㄴ', 1, 0, '2026-07-21 23:48:36', 0, NULL, NULL, NULL),
(6, 1, 'image6', 100000, 'ㅁㄴㅇㅁㄴㅇㅁㄴ', 6, 0, '2026-07-22 01:07:33', 0, '서울특별시', '노원구', '상계동'),
(7, 1, 'image7', 30000, 'ㅁㅁㅁㅁㅁㅁㅁ', 2, 0, '2026-07-22 16:23:58', 0, '서울특별시', '중구', 'xx역'),
(8, 1, 'image8', 65700, 'ㅁㅁㅁㅁㅁㅁㅁㅁ', 2, 0, '2026-07-22 16:57:04', 0, '서울특별시', '노원구', '상계동');

-- --------------------------------------------------------

--
-- 테이블 구조 `rating`
--

CREATE TABLE `rating` (
  `rating_id` int(11) NOT NULL,
  `to_member_id` int(11) NOT NULL,
  `from_member_id` int(11) NOT NULL,
  `score` double NOT NULL,
  `reg_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `chat`
--
ALTER TABLE `chat`
  ADD PRIMARY KEY (`chat_id`);

--
-- 테이블의 인덱스 `juso`
--
ALTER TABLE `juso`
  ADD PRIMARY KEY (`id`);

--
-- 테이블의 인덱스 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`member_id`);

--
-- 테이블의 인덱스 `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`order_id`);

--
-- 테이블의 인덱스 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`product_id`);

--
-- 테이블의 인덱스 `rating`
--
ALTER TABLE `rating`
  ADD PRIMARY KEY (`rating_id`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `chat`
--
ALTER TABLE `chat`
  MODIFY `chat_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 테이블의 AUTO_INCREMENT `juso`
--
ALTER TABLE `juso`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=257;

--
-- 테이블의 AUTO_INCREMENT `member`
--
ALTER TABLE `member`
  MODIFY `member_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 테이블의 AUTO_INCREMENT `orders`
--
ALTER TABLE `orders`
  MODIFY `order_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 테이블의 AUTO_INCREMENT `product`
--
ALTER TABLE `product`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- 테이블의 AUTO_INCREMENT `rating`
--
ALTER TABLE `rating`
  MODIFY `rating_id` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
